<html><head><meta charset="utf-8"/></head>
<body>
<table border="1"><tr><td><b>Time limit:</b></td><td><tt>1 s</tt></td></tr>
<tr><td><b>Real time limit:</b></td><td><tt>5 s</tt></td></tr>
<tr><td><b>Memory limit:</b></td><td><tt>64M</tt></td></tr>
</table>
<h3>Problem sm03-2: asm/hacks/wrong-function</h3>
<p>Студент Миша ошибся при написании своей функции <code>process</code> и забыл добавить пролог.
При этом с прологом его функция корректна и возвращает некоторое число.
Но вот незадача - переписать его исходный код вы не можете.</p>
<p>Напишите программу, которая вызовет функцию <code>int process();</code> ровно один раз и выведет возвращаемое число.
</p>
<p>Функция <code>process</code> скомпилирована в отдельной единице трансляции и не является статичной.
</p>
<p>Для вывода используйте <code>printf("%d\n", number);</code></p>
<p>Не используйте call process</p>
<p>Например, если Мишина функция такова:</p>
<pre>mov $4, %eax
mov %ebp, %esp
pop %ebp
ret</pre>
<p>то ваша программа должна вывести число 4.</p>
<p> </p></body></html>